# Multipliers for time, so we can account for data changing during the day due to unpredicted situations
TRAVEL_TIME_SUBWAY_X = 1.0
TRAVEL_TIME_WALK_X = 1.0
TRAVEL_TIME_TAXI_X = 1.0 # We can set this to some high value to avoid including taxi routes entirely
TRAVEL_INTERVAL_SUBWAY_X = 1.0
TRAVEL_INTERVAL_WALK_X = 0.0 # Explicitly zero, we do not need to wait for walking
TRAVEL_INTERVAL_TAXI_X = 1.0


TRANSFERS = [
    [13,30], # institut 1,2
    [12, 64], # push, zveni
    [50, 11], # dost, vlad
    [43, 52], # aleksandr nevsk 1,2
    [10, 42], # voss, majak
    [28, 41], # nevsk, gost
    [63, 29, 49], # sad, senn, spass
]


TAXI = [{
    "from": 19, # veteranov
    "to": 37, # kupchino
    "travel_interval": 2, # in this case it is a delay before taxi arrives
    "travel_time": 9,
},{
    "from": 37, # kupchino
    "to": 19, # veteranov
    "travel_interval": 2,
    "travel_time": 10,
},{
    "from": 37, # kupchino
    "to": 71, #shushary
    "travel_interval": 2,
    "travel_time": 10,
},{
    "from": 71, # shushary
    "to": 37, # kupchino
    "travel_interval": 5,
    "travel_time": 9,
},{
    "from": 71, # shushary
    "to": 48, # rybat
    "travel_interval": 6,
    "travel_time": 14,
},{
    "from": 48, # rybat
    "to": 71, # shushary
    "travel_interval": 7,
    "travel_time": 15,
},{
    "from": 48, # rybat
    "to": 56, # dybenko
    "travel_interval": 7,
    "travel_time": 16,
},{
    "from": 56, # dybenk
    "to": 48, # rybat
    "travel_interval": 4,
    "travel_time": 17,
},{
    "from": 38, # begov
    "to": 57, # komen
    "travel_interval": 2,
    "travel_time": 11,
},{
    "from": 57, # komen
    "to": 38, # begov
    "travel_interval": 6,
    "travel_time": 10,
},{
    "from": 57, # komen
    "to": 20, # parnas
    "travel_interval": 4,
    "travel_time": 19,
},{
    "from": 20, # parnas
    "to": 57, # komen
    "travel_interval": 8,
    "travel_time": 16,
},{
    "from": 20, # parnas
    "to": 1, # dev
    "travel_interval": 7,
    "travel_time": 14,
},{
    "from": 1, # dev
    "to": 20, # parnas
    "travel_interval": 3,
    "travel_time": 14,
}]


TIME_OPEN = {
    "девяткино":"5-32",
    "гражданский проспект":"5-30",
    "академическая":"5-35",
    "политехническая":"5-36",
    "площадь мужества":"5-38",
    "лесная":"5-40",
    "выборгская":"5-44",
    "площадь ленина":"5-35",
    "чернышевская":"5-38",
    "площадь восстания":"5-40",
    "владимирская":"5-35",
    "пушкинская":"5-38",
    "технологический институт-1":"5-40", # same as технологический институт-2, since -1 is closed
    "балтийская":"5-36",
    "нарвская":"5-36",
    "кировский завод":"5-30",
    "автово":"5-30",
    "ленинский проспект":"5-40",
    "проспект ветеранов":"5-38",
    "парнас":"-",
    "проспект просвещения":"-",
    "озерки":"-",
    "удельная":"-",
    "пионерская":"-",
    "чёрная речка":"-",
    "петроградская":"5-45",
    "горьковская":"5-37",
    "невский проспект":"5-36",
    "сенная площадь":"5-36",
    "технологический институт-2":"5-40",
    "фрунзенская":"5-45",
    "московские ворота":"5-43",
    "электросила":"5-40",
    "парк победы":"5-37",
    "московская":"5-35",
    "звёздная":"5-31",
    "купчино":"5-30",
    "беговая":"-",
    "приморская":"-",
    "василеостровская":"-",
    "гостиный двор":"-",
    "маяковская":"-",
    "площадь александра невского-1":"-",
    "елизаровская":"-",
    "ломоносовская":"-",
    "пролетарская":"-",
    "обухово":"-",
    "рыбацкое":"-",
    "спасская":"-",
    "достоевская":"-",
    "лиговский проспект":"-",
    "площадь александра невского-2":"-",
    "новочеркасская":"-",
    "ладожская":"-",
    "проспект большевиков":"-",
    "улица дыбенко":"-",
    "комендантский проспект":"-",
    "старая деревня":"-",
    "крестовский остров":"-",
    "чкаловская":"-",
    "спортивная":"-",
    "адмиралтейская":"-",
    "садовая":"-",
    "звенигородская":"-",
    "обводный канал":"-",
    "волковская":"-",
    "бухарестская":"-",
    "международная":"-",
    "проспект славы":"-",
    "дунайская":"-",
    "шушары":"-",
}


TIME_CLOSE = {
    "девяткино":"-",
    "гражданский проспект":"-",
    "академическая":"-",
    "политехническая":"-",
    "площадь мужества":"-",
    "лесная":"-",
    "выборгская":"-",
    "площадь ленина":"-",
    "чернышевская":"-",
    "площадь восстания":"-",
    "владимирская":"-",
    "пушкинская":"-",
    "технологический институт-1":"-",
    "балтийская":"-",
    "нарвская":"-",
    "кировский завод":"-",
    "автово":"-",
    "ленинский проспект":"-",
    "проспект ветеранов":"-",
    "парнас":"-",
    "проспект просвещения":"-",
    "озерки":"-",
    "удельная":"-",
    "пионерская":"-",
    "чёрная речка":"-",
    "петроградская":"-",
    "горьковская":"-",
    "невский проспект":"-",
    "сенная площадь":"-",
    "технологический институт-2":"-",
    "фрунзенская":"-",
    "московские ворота":"-",
    "электросила":"-",
    "парк победы":"-",
    "московская":"-",
    "звёздная":"-",
    "купчино":"-",
    "беговая":"-",
    "приморская":"-",
    "василеостровская":"-",
    "гостиный двор":"-",
    "маяковская":"-",
    "площадь александра невского-1":"-",
    "елизаровская":"-",
    "ломоносовская":"-",
    "пролетарская":"-",
    "обухово":"-",
    "рыбацкое":"-",
    "спасская":"-",
    "достоевская":"-",
    "лиговский проспект":"-",
    "площадь александра невского-2":"-",
    "новочеркасская":"-",
    "ладожская":"-",
    "проспект большевиков":"-",
    "улица дыбенко":"-",
    "комендантский проспект":"-",
    "старая деревня":"-",
    "крестовский остров":"-",
    "чкаловская":"-",
    "спортивная":"-",
    "адмиралтейская":"-",
    "садовая":"-",
    "звенигородская":"-",
    "обводный канал":"-",
    "волковская":"-",
    "бухарестская":"-",
    "международная":"-",
    "проспект славы":"-",
    "дунайская":"-",
    "шушары":"-",
}

